Repository: elementary/dock
Catalog: po/extra/*.po
Languages: be, ca, he, hu, ja, ru, sv, uk

source: Dock
be: Док
ca: Acoblador
he: מעגן
hu: Dokk
ja: ドック
ru: Док
sv: Docka
uk: Док

source: Launch apps and switch between them
be: Запускайце праграмы і пераключайцеся паміж імі
ca: Obriu aplicacions i canvieu entre unes i altres
he: הפעלת יישומים ומעבר ביניהם
hu: Alkalmazások megnyitása és váltás köztük
ja: アプリを起動したり切り替えたりします
ru: Запускайте приложения и переключайтесь между ними
sv: Starta appar och växla mellan dem
uk: Запуск застосунків і перемикання між ними

source: elementary, Inc.
he: elementary בע״מ.

source: Updated translations
be: Абноўлены пераклады
ca: Traduccions actualitzades
he: התרגומים עודכנו
hu: Frissített fordítások
ja: 翻訳の更新
ru: Обновлены переводы
sv: Uppdaterade översättningar
uk: Оновлені переклади

source: Open context menus with long-press
be: Адкрыццё кантэкстнага меню праз доўгае націсканне
ca: Obre els menús contextuals amb una pressió sostinguda
he: אפשר לפתוח תפריטי הקשר בלחיצה ארוכה
hu: Menük megnyitása hosszú érintéssel
ja: 長押しでコンテキストメニューを表示する機能を追加
ru: Открытие контекстного меню с помощью долгого нажатия
sv: Öppna snabbmenyer med lång tryckning
uk: Відкриття контекстного меню затисканням

source: Cycle through windows when hovering over an app with drag-and-drop
be: Цыклаванне акон пры навядзенні на праграму пры перацягванні аб'ектаў
ca: Navegueu per les finestres quan passeu el cursor per sobre d'una aplicació amb arrossegar i deixar anar
he: מעבר במחזוריות בין החלונות בעת ריחוף מעל יישום עם גרירה
hu: Ablakok váltogatása objektumok az alkalmazás fölé húzásakor
ja: ドラッグアンドドロップ中にドック上のアイコンをホバーすると、ウィンドウを切り替える機能を追加
ru: Прокрутка окон при наведении на иконку при перетаскивании объектов
sv: Bläddra igenom fönster när du håller muspekaren över en app med dra-och-släpp
uk: Перехід між вікнами за наведення на застосунок за допомогою перетягування

source: Improve memory usage
be: Паляпшэнні выкарыстання памяці
ca: Millora l'ús de la memòria
he: שיפור ניצולת הזיכרון
hu: Memóriahasználat javítása
ja: メモリー使用量を改善
ru: Улучшено управление памятью
sv: Förbättra minnesanvändning
uk: Поліпшено використання пам'яті

source: Fix dock bounds when hide mode is 'Never'
be: Выпраўленні граніц доку, калі рэжым хавання "Ніколі"
ca: Correcció dels límits de l'acoblador quan el mode d'ocultació és Mai
he: תוקנו גבולות המעגן כשמצב ההסתרה הוא‚אף פעם’
hu: A Dokk határainak javítása 'Soha' elrejtési módot használva
ja: “ドックを隠す”が“なし”の場合に、ドックの表示領域外の操作も受け付けてしまう不具合を修正
ru: Исправлены границы окна при отображении Дока
sv: Fixa dockgränser när döljningsläget är "Aldrig"
uk: Виправлено межі доку, коли режим приховування "Ніколи"

source: Fixes a crash when dragging a file that's not a launcher to the dock
be: Выпраўленне збою пры перацягванні в док не праграмы для запуску
ca: Solució d'un error en arrossegar un fitxer que no és un llançador a l'acoblador
he: תוקנה תקלה בגרירת קובץ שאינו משגר למעגן
hu: Összeomlás javítva nem indítófájl dokkra húzásakor
ja: ランチャーではないファイルをドックにドラッグするとクラッシュする不具合を修正
ru: Исправлен сбой при перетаскивании в док файла, не являющегося файлом запуска
sv: Åtgärdar en krasch när du drar en fil som inte är ett startprogram till dockan
uk: Виправлено збій під час перетягування файлу, який не є панеллю запуску, до доку

source: Hide badges, progressbars, and running indicators while dragging a launcher
be: Хаванне значкоў, панэляў выканання і індыкатараў працы пры перацягванні праграмы запуску
ca: Amaga insígnies, barres de progrés i indicadors d'execució mentre s'arrossega un llançador.
he: הסתרת עיטורים, סרגל התקדמות ומחווני הפעלה בעת גרירת משגר
hu: Buborékok, előrehaladási jelzések és futásindikátorok elrejtése indítóikon húzásakor
ja: ランチャーをドラッグしている間は、バッジ、プログレスバー、起動状態を示すインジケーターを表示しないように修正
ru: Скрытие эмблем, индикаторов прогресса и запуска, при перетаскивании файла запуска
sv: Dölj märken, förloppsmätare och körindikatorer när du drar ett startprogram
uk: Приховування значків, індикаторів виконання та індикаторів роботи під час перетягування лаунчера

source: Complete rewrite 🎉️
be: Поўнае перапісванне 🎉️
ca: Reescriptura completa 🎉️
he: שכתוב מלא מחדש 🎉️
hu: Teljes újraírás 🎉️
ja: コードの全面的な書き直し 🎉️
ru: Переписан с нуля 🎉️
sv: Komplett omskrivning 🎉️
uk: Повністю переписано🎉️
