Repository: elementary/dock
Catalog: po/*.po
Languages: ar, gu

source: Stupidly simple.
ar: بسيط بغباء.

source: Plank is meant to be the simplest dock on the planet. The goal is to provide just what a dock needs and absolutely nothing more.
ar: يهدف Plank ليكون أبسط مرسى في العالم. الهدف هو تقديم ما يحتاج له مرسى للأيقونات فقط و لا شيء آخر على الإطلاق.

source: It is, however, a library which can be extended to create other dock programs with more advanced features. Thus, Plank is the underlying technology for Docky (starting in version 3.0.0) and aims to provide all the core features while Docky extends it to add fancier things like Docklets, painters, settings dialogs, etc.
ar: إنها -مع ذلك- عبارة عن مكتبة يمكن توسيعها لإنشاء برامج مرسى أخرى بميزات متقدمة. ولهذا، Plank هو التقنية الكامنة وراء Docky (ابتداء من إصدار 3.0.0) وهو يهدف إلى توفير جميع الميزات الأساسية، بينما Docky يقوم بتوسيعها لإضافة أشياء أكثر فخامة.

source: The Plank Developers
ar: مطورو Plank

source: Dock
ar: المرسى

source: Theme:
ar: السمة:
gu: થીમ:

source: Position:
ar: الموقع:
gu: સ્થિતિ:

source: Left
ar: يسار
gu: ડાબી બાજુ

source: Right
ar: يمين
gu: જમણી બાજુ

source: Top
ar: فوق
gu: ઉપરની બાજુ

source: Bottom
ar: أسفل
gu: નીચેની બાજુ

source: Alignment:
ar: المحاذاة:
gu: ગોઠવણી:

source: Fill
ar: الملء
gu: ભરવું

source: Start
ar: البداية
gu: શરૂઆત

source: End
ar: النهاية
gu: અંત

source: Center
ar: المنتصف
gu: મધ્ય

source: On Primary Display:
ar: على شاشة العرض الأساسية:
gu: પ્રાથમિક ડિસ્પ્લે પર:

source: Offset in percent from the center of the screen-edge
ar: البعد بالنسبة المئوية عن منتصف زاوية الشاشة

source: Icon Alignment:
ar: محاذاة الأيقونات:
gu: ચિહ્ન સંરેખણ:

source: Icon Size:
ar: حجم الأيقونات:
gu: આઇકોનનું કદ:

source: Appearance
ar: المظهر
gu: દેખાવ

source: Intellihide
ar: إخفاء ذكي

source: Autohide
ar: إخفاء تلقائي

source: Dodge maximized window
ar: تفادي النافذة المكبرة

source: Window Dodge
ar: تفادي النوافذ

source: Dodge active window
ar: تفادي النافذة الفعالة

source: Hide Dock
ar: أخف المرسى
gu: dock છુપાવો

source: Hide Delay:
ar: مدة تأخير الإخفاء:
gu: વિલંબ છુપાવો:

source: Delay in ms before hiding the dock
ar: مدة التأخير بأجزاء الثانية قبل إخفاء المرسى
gu: ડોક છુપાવતા પહેલા મિલી સેકન્ડમાં વિલંબ

source: Unhide Delay:
ar: تأخير الإظهار:
gu: વિલંબ પ્રકટ કરો:

source: Delay in ms before showing the dock
ar: مدة التأخير بأجزاء الثانية قبل إظهار المرسى

source: Pressure Reveal:
ar: الإظهار بالضغط:

source: Item Management
ar: إدارة العناصر

source: Show Unpinned:
ar: إظهار التطبيقات غير المثبتة:
gu: અનપિન કરેલ બતાવો:

source: Restrict to Workspace:
ar: الحصر في مساحة عمل معينة:
gu: Workspace સુધી મર્યાદિત કરો:

source: Lock Icons:
ar: تثبيت الأيقونات:
gu: લોક આઇકોન્સ:

source: Behaviour
ar: السلوك
gu: વર્તણૂક

source: Docklets
ar: أدوات المرسى
gu: ડોકલેટ્સ

source: Applications
ar: التطبيقات
gu: એપ્લિકેશન્સ

source: No battery
ar: لا يوجد بطارية
gu: બેટરી નથી

source: Battery
ar: البطارية
gu: બેટરી

source: Displays battery information
ar: تعرض معلومات البطارية
gu: બેટરીની માહિતી દર્શાવો

source: CPU Monitor
ar: مراقب المعالج
gu: સીપીયુ મોનિટર

source: Keep an eye on that CPU. And when it gets out of line...
ar: ابق عينيك على ذلك المعالج. وعندما يتصرف بطريقة غير معتادة...

source: Clipboard is currently empty.
ar: الحافظة فارغة حالياً.

source: _Clear
ar: امسح

source: Keep recent clipboard entries.
ar: أبق الأشياء التي تم نسخها حديثاً.

source: Di_gital Clock
ar: الساعة الرقمية

source: 24-Hour _Clock
ar: ساعة بنظام 24 ساعة

source: Show _Date
ar: أظهر التاريخ

source: Clock
ar: الساعة

source: What time is it?
ar: ما هو الوقت الآن؟
gu: કેટલા વાગ્યા?

source: Show Desktop
ar: أظهر سطح المكتب
gu: ડેસ્કટોપ બતાવો

source: Desktop
ar: سطح المكتب
gu: ડેસ્કટોપ

source: Show your Desktop.
ar: أظهر سطح المكتب الخاص بك.
gu: તમારું ડેસ્કટોપ બતાવો.

source: No items in Trash
ar: لا يوجد شيء في سلة المهملات
gu: કચરાપેટીમાં કોઈ વસ્તુ નથી

source: %u item in Trash
ar: لا يوجد شيء في سلة المهملات
gu: કચરાપેટીમાં %u વસ્તુ છે

source: Drop to move to Trash
ar: اتركه لنقله إلى سلة المهملات
gu: કચરાપેટીમાં નાખવા માટે છોડો

source: _Open Trash
ar: افتح سلة المهملات
gu: કચરાપેટી ખોલો (O)

source: Empty _Trash
ar: أفرغ سلة المهملات
gu: કચરાપેટી ખાલી કરો(T)

source: Empty all items from Trash?
ar: هل تريد إفراغ جميع العناصر من سلة المهملات؟
gu: કચરાપેટીમાંથી બધી વસ્તુઓ ખાલી કરવી છે?

source: All items in the Trash will be permanently deleted.
ar: جميع عناصر سلة المهملات سيتم حذفها نهائياً.
gu: કચરાપેટીમાંથી બધી વસ્તુઓ કાયમ માટે કાઢી નાખવામાં આવશે.

source: _Cancel
ar: ألغ
gu: માંડી વાળો(C)

source: Trash
ar: أفرغ
gu: કચરાપેટી

source: Have a look at your trash!
ar: ألق نظرة على سلة المهملات!
gu: તમારી કચરાપેટી પર એક નજર નાખો!

source: Drop to add to dock
ar: اتركه لإضافته إلى المرسى
gu: ડોકમાં ઉમેરવા માટે છોડો

source: translator-credits
ar: Launchpad Contributions: Abdulrahman M. S. https://launchpad.net/~saanina Anass Eljondy https://launchpad.net/~great-anass Karim Oulad Chalha https://launchpad.net/~herr-linux Rico Tzschichholz https://launchpad.net/~ricotz abd https://launchpad.net/~raryat محمد أحمد https://launchpad.net/~mohamedstarwars

source: _Keep in Dock
ar: أبقه على المرسى

source: _Close All
ar: أغلق الكل

source: _Close
ar: أغلق

source: Drop to open with %s
ar: اتركه لفتحه على %s

source: _Open in File Browser
ar: افتح في متصفح الملفات

source: _Open
ar: افتح
gu: ખોલો(O)

source: Open Containing _Folder
ar: افتح المجلد الذي يحتوي الملف

source: Drop applications or files here
ar: اسحب تطبيقات أو ملفات هنا
gu: એપ્લિકેશન અથવા ફાઇલો અહીં છોડો

source: Get _Help Online...
ar: احصل على المساعدة عبر الإنترنت...
gu: ઑનલાઇન સહાય મેળવો(H)...

source: _Translate This Application...
ar: ترجم هذا التطبيق...
gu: આ એપ્લિકેશનનું અનુવાદ કરો(T)...

source: Preferences
ar: التفضيلات
gu: પસંદગીઓ
